Revit 2027 API
ExternalServices.BuiltInExternalServices.DirectContext3DService Property
 The external service that provides the facility to draw externally specified geometry in a Revit view in a way that is conceptually similar to a low-level graphics API. To use this service, programmers implement a server class that derives from Autodesk::Revit::DB::DirectContext3D::IDirectContext3DServer.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId DirectContext3DService { get; }
Public Shared ReadOnly Property DirectContext3DService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ DirectContext3DService {
	ExternalServiceId^ get ();
}
static member DirectContext3DService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace